# GetTreeControlItemData

## Description
Retrieves the user data of the specified item from a tree control.

```pascal
PROCEDURE GetTreeControlItemData(
				nDialogID     : LONGINT;
				nComponentID  : LONGINT;
				nItemID       : INTEGER;
				VAR nUserData : LONGINT);
```

```python

def vs.GetTreeControlItemData(nDialogID, nComponentID, nItemID):
    return nUserData
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT||
|nComponentID|LONGINT||
|nItemID|INTEGER||
|nUserData|LONGINT||

## Version
Availability: from VectorWorks12.5
## Category
* Dialogs - Modern